export const exercises: Record<string, Array<string[]>> = {
  back: [
    ["Подтягивания на перекладине", "Тяга верхнего блока к груди"],
    ["Тяга нижний блок", "Тяга т-образного грифа", "Тяга штанги к поясу"],
    [
      "Тяга блока к груди узким хватом",
      "Подтягивания на низкой перекладине",
      "Пуловер с гантелью",
    ],
  ],
  biceps: [
    [
      "Подтягивания обратным хватом",
      "Молотковый подъем",
      "Подъемы штанги стоя",
    ],
    [
      "Сгибания рук на наклонной скамье",
      "Молотковый подъем",
      "Поднятие штанги на скамье Скотта",
      "Сгибания рук на тренажере  нижний блока",
      "Сгибания в кроссовере",
      "Сгибания рук с гантелями",
    ],
  ],
  triceps: [
    ["Французский жим", "Жим лежа узким хватом", "Отжимания на брусьях"],
    [
      "Разгибание рук в наклоне",
      "Разгибание руки верхний блок",
      "Разгибание рук верхний блок",
      "Разгибание рук из-за головы",
      "Отжимания в упоре сзади",
      "Махи гантелями под углом",
    ],
  ],
  shoulder: [
    [
      "Жим штанги из положения стоя",
      "Жим со штангой из-за головы",
      "Армейский жим",
    ],
    [
      "Жим Арнольда",
      "Подъем гантелей в стороны",
      "Поднятие штанги к подбородку",
      "Тяга Ли Хейни",
      "Разведение гантелей в стороны сидя в наклоне",
      "Подъем руки перед собой в кроссовере",
    ],
  ],
  legs: [
    ["Приседания со штангой", "Фронтальные приседания", "Становая тяга"],
    [
      "Жим ногами в тренажёре",
      "Выпады с гантелями",
      "Разгибание ног в тренажёре",
    ],
    ["Сгибание ног в тренажёре лёжа", "Подъём на носки", "Выпады с гантелями"],
  ],
  additional: [
    [
      "Сгибание запястий нижнем блоке",
      "Поднятие гантель/трапы ",
      "Гиперэкстензия",
      "Подъем корпуса ",
      "Упражнение «Уголок»",
      "Скручивания в тренажере",
      "Супермен",
      "Гиперэкстензия",
      "Шраги",
    ],
  ],
  pectoral: [
    [
      "Жим штанги лежа",
      "Жим штанги под углом 45% ",
      "Жим отрицательный наклоном ",
    ],
    ["Жим гантелей под углом 45%", "Отжимания на брусьях"],
    ["Сведения рук в кроссовере", "Разводка гантелей лежа"],
  ],
};
